---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyMonitorFailures.CannotMoveHostedFixtureViaCopyMonitor
source: html/3f5916f1-0f50-e16e-fa3a-6044d5877e38.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyMonitorFailures.CannotMoveHostedFixtureViaCopyMonitor Property

The fixture is hosted and cannot be moved. Use the Move command to relocate the fixture in the host file as required.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMoveHostedFixtureViaCopyMonitor { get; }
```